; Виведення заголовка (TITLE) програми у другому рядку кожної
; сторінки лістингу
TITLE	ASCOM	COM-ПРОГРАМА ПЕРЕМІЩЕННЯ ТА ДОДАВАННЯ
;Вирівнювання адреси сегмента кода на межу параграфа – адреса
;націло ділиться на 16 (10Н)
CODESEG	SEGMENT	PARA 'Code'	
;Регістри CS, DS, SS, ES повинні містити адресу початку ;сегмента кода
ASSUME 	CS:CODESEG, DS:CODESEG, SS:CODESEG, ES:CODESEG
;Початок для COM-програми, резервування місця під стек
ORG	100H
;Значення 100Н розміщено в регістр ІР, тому наступне речення
;після ORG повинно бути виконуваною командою
Begin:	JMP MAIN; JMP – команда переходу на мітку MAIN
;Якщо дані записати після інструкцій,
; то потреби у операторі JMP немає 
;--------------------------------------------------------
DD1	DW	220		; Визначення даних
DD2	DW	115		
DD3	DW	?
;-----------------------------------------------------------
MAIN		PROC		NEAR	;Процедура MAIN
		MOV		AX, DD1	; В регістр АХ переслати 220
		ADD		AX, DD2	;Додати 115 до АХ 
		MOV		DD3, AX	;Переслати суму в DD3
		MOV		AX, 4C00H	; Завершити роботу
		INT		21H
MAIN		ENDP		;Кінець процедури MAIN
CODESEG	ENDS		;Кінець сегмента кода
		END	BEGIN
